app/auth/authenticate_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "datphamba0.13@gmail.com"], ["LIMIT", 1]]
---
  def user
    user = User.find_by(email: email)