app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "teacher@example.com"], ["LIMIT", 1]]
---
  def authenticate
    currentUser = User.find_by(email: auth_params[:email])