app/controllers/items_controller.rb

  def create
    @todo.items.create!(item_params)
---
INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Example Test 1"], ["done", 0], ["todo_id", 3], ["created_at", "2020-05-01 09:30:10.705934"], ["updated_at", "2020-05-01 09:30:10.705934"]]

  def update
    @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "question" = ?, "correct" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Example Test 3"], ["question", "Which company has created the Surface Pro? UPDATE"], ["correct", "Bill Gate"], ["updated_at", "2020-05-03 09:45:57.185228"], ["id", 27]]

  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo
---
SELECT "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 3], ["id", 26], ["LIMIT", 1]]