app/controllers/todos_controller.rb

  def create
    @todo = current_user.todos.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at", "description", "total_questions") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test 2"], ["created_by", "1"], ["created_at", "2020-05-03 04:49:20.680252"], ["updated_at", "2020-05-03 04:49:20.680252"], ["description", "des 2"], ["total_questions", 3]]

  def update
    @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Who is the father of IPHONE ?"], ["updated_at", "2020-05-01 08:53:37.165703"], ["id", 3]]