app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create!(user_params)

UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 2], ["updated_at", "2020-05-02 18:55:30.694342"], ["id", 3]]
---
  def update
    @user.update(change_permission)